{"product_uid": 100006, "product_description": "Achieving delicious results is almost effortless with this Whirlpool over-the-range microwave hood with convection cooking. With 1.9 cu. ft. capacity, you'll have room to prepare multiple dishes at once. And, you won't have to micro-manage the cooking process thanks to the sensor cooking options. Sensor cooking tracks cooking progress and automatically adjusts cooking time. Convection roasting and baking allows you to bake cakes, bread, cookies and roast meats with ease. Clean-up is simple too with the industry leading CleanRelease non-stick interior surface. It easily releases cooked-on food without the use of harsh chemicals. A damp cloth or sponge is all that is needed to remove cooked-on spills and splashes.California residents: see&nbsp;Proposition 65 informationSpacious 1.9 cu. ft. capacity accommodates dinner plates and casserole dishes with ease1100 watts of cooking power and 10 cooking levels make cooking and reheating a snap400 CFM venting system whisks smoke, steam and odors away from the cooktop to keep your kitchen air clearSingle piece door with built-in touch-activated control console streamlines the exterior for a sleek, modern look and easy cleanupCook with confidence with the Sensor and Programmed cooking cycles and options. Sensor cycles include: Steam/Simmer, AccuPop and Potato for fast prep of family favoritesKids' Menu: it's simple, it's fast. The Kids' Menu is preset with cooking times and power levels for a variety of favorites like pizza and chicken nuggets. Now after school snacks don't have to be an afternoon hassleTimeSavor Plus True Convection cooking uses a 1600-watt element and a fan to circulate heat over, under and around food for fast cooking and even browningIndustry leading CleanRelease non-stick interior requires no special cleaners. A damp cloth or sponge is all that's needed to remove cooked-on spills and splashesRecessed turntable's on/off feature is especially helpful when cooking with plates that are larger than the turntableAutomatic interior incandescent light and large window help you track cooking progress4-speed fan with Auto Vent Fan function. To keep the microwave oven from overheating, the vent fan will automatically turn on at high speed if the temperature from the range or cooktop below the microwave oven gets too hotReplaceable charcoal and dishwasher safe mesh filters takes grease and other impurities out of the air90 hinge. With this innovative hinge design you can install this model next to a wall and still open the door easilyLimited 1-year warrantyConvertible venting. Can be installed as vented or non-vented (recirculating) to fit a variety of installation needsAccuPop cycle senses the perfect pop every time. It adapts cooking time using a sound sensor that measures the time between pops so you don't have to worry about bag size or excessive unpopped kernels. Now you can finally watch the movie, not the microwaveIncluded items: convection rack, SureMist steamer and cooking rack. Included cooking rack lets you microwave on two levels, so you can cook several items at onceClick Here for details on the services included with Delivery & Basic Hook-up and Installation options for this product", "product_attributes": {"Appliance Type": "Over the Range Microwave", "Assembled Depth (in.)": "18.5 in", "Assembled Height (in.)": "17.13 in", "Assembled Width (in.)": "29.94 in", "Bullet01": "Spacious 1.9 cu. ft. capacity accommodates dinner plates and casserole dishes with ease", "Bullet02": "1100 watts of cooking power and 10 cooking levels make cooking and reheating a snap", "Bullet03": "400 CFM venting system whisks smoke, steam and odors away from the cooktop to keep your kitchen air clear", "Bullet04": "Single piece door with built-in touch-activated control console streamlines the exterior for a sleek, modern look and easy cleanup", "Bullet05": "Cook with confidence with the Sensor and Programmed cooking cycles and options. Sensor cycles include: Steam/Simmer, AccuPop and Potato for fast prep of family favorites", "Bullet06": "Kids' Menu: it's simple, it's fast. The Kids' Menu is preset with cooking times and power levels for a variety of favorites like pizza and chicken nuggets. Now after school snacks don't have to be an afternoon hassle", "Bullet07": "TimeSavor Plus True Convection cooking uses a 1600-watt element and a fan to circulate heat over, under and around food for fast cooking and even browning", "Bullet08": "Industry leading CleanRelease non-stick interior requires no special cleaners. A damp cloth or sponge is all that’s needed to remove cooked-on spills and splashes", "Bullet09": "Recessed turntable's on/off feature is especially helpful when cooking with plates that are larger than the turntable", "Bullet10": "Automatic interior incandescent light and large window help you track cooking progress", "Bullet11": "4-speed fan with Auto Vent Fan function. To keep the microwave oven from overheating, the vent fan will automatically turn on at high speed if the temperature from the range or cooktop below the microwave oven gets too hot", "Bullet12": "Replaceable charcoal and dishwasher safe mesh filters takes grease and other impurities out of the air", "Bullet13": "90° hinge. With this innovative hinge design you can install this model next to a wall and still open the door easily", "Bullet14": "Limited 1-year warranty", "Bullet15": "Convertible venting. Can be installed as vented or non-vented (recirculating) to fit a variety of installation needs", "Bullet16": "AccuPop cycle senses the perfect pop every time. It adapts cooking time using a sound sensor that measures the time between pops so you don't have to worry about bag size or excessive unpopped kernels. Now you can finally watch the movie, not the microwave", "Bullet17": "Included items: convection rack, SureMist steamer and cooking rack. Included cooking rack lets you microwave on two levels, so you can cook several items at once", "Capacity of Microwave (cu. ft.)": "1.9", "Certifications and Listings": "1-UL Listed", "Color/Finish": "Stainless Steel", "Color/Finish Family": "Stainless", "Cut-Out Front to Back Width (in.)": "12", "Cut-Out Height (in.)": "17.13", "Cut-Out Left to Right Length (in.)": "30", "Door Swing/Style": "Right to Left Swing", "Exhaust Fan Speeds": "4", "Exhaust Maximum CFM": "400", "MFG Brand Name": "Whirlpool", "Microwave Door Release": "Pull", "Microwave Features": "Charcoal Filter,Clock,Convection,Cooktop Lighting,Interior Light,Microwave Rack,Nightlight,One Touch Cooking,Removable Filter,Steam Cook,Timer,Turntable,Turntable On/Off Option", "Microwave Size": "30 in.", "Number of One-Touch Settings": "6", "Number of Power Levels": "10", "Oven Settings": "Defrost,Keep Warm,Sensor Cook", "Product Depth (in.)": "18.5", "Product Height (in.)": "17.13", "Product Weight (lb.)": "67.1", "Product Width (in.)": "29.94", "Safety Listing": "UL", "Sensor Cook": "Yes", "Turntable": "Yes", "Turntable Diameter": "14", "Vent Type": "Convertible", "Wattage (watts)": "1100"}}