{"product_uid": 100002, "product_description": "BEHR Premium Textured DECKOVER is an innovative solid color coating. It will bring your old, weathered wood or concrete back to life. The advanced 100% acrylic resin formula creates a durable coating for your tired and worn out deck, rejuvenating to a whole new look.  For the best results, be sure to properly prepare the surface using other applicable BEHR products displayed above.California residents: see&nbsp;Proposition 65 informationRevives wood and composite decks, railings, porches and boat docks, also great for concrete pool decks, patios and sidewalks100% acrylic solid color coatingResists cracking and peeling and conceals splinters and cracks up to 1/4 in.Provides a durable, mildew resistant finishCovers up to 75 sq. ft. in 2 coats per gallonCreates a textured, slip-resistant finishFor best results, prepare with the appropriate BEHR product for your wood or concrete surfaceActual paint colors may vary from on-screen and printer representationsColors available to be tinted in most storesOnline Price includes Paint Care fee in the following states: CA, CO, CT, ME, MN, OR, RI, VT", "product_attributes": {"Application Method": "Brush,Roller,Spray", "Assembled Depth (in.)": "6.63 in", "Assembled Height (in.)": "7.76 in", "Assembled Width (in.)": "6.63 in", "Bullet01": "Revives wood and composite decks, railings, porches and boat docks, also great for concrete pool decks, patios and sidewalks", "Bullet02": "100% acrylic solid color coating", "Bullet03": "Resists cracking and peeling and conceals splinters and cracks up to 1/4 in.", "Bullet04": "Provides a durable, mildew resistant finish", "Bullet05": "Covers up to 75 sq. ft. in 2 coats per gallon", "Bullet06": "Creates a textured, slip-resistant finish", "Bullet07": "For best results, prepare with the appropriate BEHR product for your wood or concrete surface", "Bullet08": "Actual paint colors may vary from on-screen and printer representations", "Bullet10": "Colors available to be tinted in most stores", "Bullet18": "Online Price includes Paint Care fee in the following states: CA, CO, CT, ME, MN, OR, RI, VT", "Cleanup": "Soap and Water", "Color Family": "Browns / Tans", "Color/Finish": "Tugboat", "Concrete Use": "Yes", "Container Size": "1 GA-Gallon", "Coverage Area (sq. ft.)": "75", "Deck Use": "Yes", "Interior/Exterior": "Exterior", "MFG Brand Name": "BEHR Premium Textured DeckOver", "Mildew Resistant": "Yes", "Opacity": "Solid", "Paint Product Type": "Exterior Paint/Stain", "Patching & Repair Product Type": "Restoration Coating", "Product Style": "Cottage", "RGB Value": "119:100:086", "Sealer": "No", "Time before recoating (hours)": "6", "Tintable": "No", "Transparency": "Solid", "UV Resistant": "Yes", "Waterproof": "No"}}